app/controllers/school_classes_controller.rb

  def create
    school_class = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2016-10-25 19:06:35.615638"], ["updated_at", "2016-10-25 19:06:35.615638"]]

  def update
    school_class = SchoolClass.find(params[:id])
    school_class.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-10-25 19:15:33.301283"], ["id", 1]]